$(function (){
    $('header .nav-link').on('click', function(e) {
      e.preventDefault(); // Запрещаем переход по ссылке
      var target= $(this).attr('href'), // Берем значение из ссылки как цель id="second-screen"
            destination= $(target).offset().top; // Ищем верхнюю координату у нашей цели

      $('body,html').animate({scrollTop: destination}, 500); // Плавно проматываем до цели
    });

    $('.head-slide').owlCarousel({
        loop:true,
        // autoplay : true,
        // autoplayTimeout : 8000,
        margin:30,
        nav:true,
        dots:true,
        center: false,
        smartSpeed:900,
        items:1,
        navText: ['<span><svg width="12" height="11" viewBox="0 0 12 11" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M0.316319 6.34835L4.2756 10.0667C4.68312 10.4572 5.33685 10.4572 5.74437 10.0667C6.15189 9.67613 6.15189 9.04963 5.74437 8.65909L3.55951 6.64126L10.3171 6.64126C10.8944 6.64126 11.3613 6.19376 11.3613 5.64049C11.3613 5.08721 10.8944 4.63971 10.3171 4.63971L3.568 4.63971L5.75286 2.62189C6.16038 2.23134 6.16038 1.60484 5.75286 1.2143C5.34534 0.82375 4.69161 0.82375 4.28408 1.2143L0.324809 4.93262C0.121048 5.1279 0.0191689 5.38012 0.0191689 5.64049C0.0191689 5.90085 0.112558 6.15308 0.316319 6.34835Z" fill="#fff"/></svg></span>','<span><svg width="12" height="11" viewBox="0 0 12 11" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.6837 4.9329L7.7244 1.21457C7.31688 0.824023 6.66315 0.824023 6.25563 1.21457C5.84811 1.60512 5.84811 2.23162 6.25563 2.62216L8.44049 4.63999H1.68295C1.10562 4.63999 0.638672 5.08749 0.638672 5.64076C0.638672 6.19404 1.10562 6.64154 1.68295 6.64154H8.432L6.24714 8.65936C5.83962 9.04991 5.83962 9.67641 6.24714 10.067C6.65466 10.4575 7.30839 10.4575 7.71592 10.067L11.6752 6.34863C11.879 6.15335 11.9808 5.90113 11.9808 5.64076C11.9808 5.3804 11.8874 5.12817 11.6837 4.9329Z" fill="white"/></svg></span>'],
        responsive:{
            0:{
                items:1,
            },
            600:{
                items:1,
                margin:0,
            },
            1000:{
                items:1,
                margin:10,
            }
        }
    });


    $('.menu-mob, .menu-closer').on('click',function(e){
        e.preventDefault();
        $('.top-left').toggleClass('active');
    });

    
    

});

